Revit 2027 API
TemporaryGraphicsManager.GetTemporaryGraphicsManager Method
 Gets a TemporaryGraphicsManager reference of the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static TemporaryGraphicsManager GetTemporaryGraphicsManager(
	Document document
)
Public Shared Function GetTemporaryGraphicsManager (
	document As Document
) As TemporaryGraphicsManager
public:
static TemporaryGraphicsManager^ GetTemporaryGraphicsManager(
	Document^ document
)
static member GetTemporaryGraphicsManager :
        document : Document -> TemporaryGraphicsManager
Parameters
document Document
 The document.
Return Value
TemporaryGraphicsManager
 Instance of TemporaryGraphicsManager.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace